/* D E B U G . H */

/* W I N D O W S  A L L O C  F A I L U R E S */
#include "debugwin.h"

/* this is to ease the pain of who has and who doesn't have PROFILE
	defined for putobj/takeobj purposes.
*/
#ifdef DEBUG
#ifndef PROFILE
#define PROFILE
#endif /* PROFILE */
#endif /* DEBUG */
#ifdef HYBRID
#ifndef PROFILE
#define PROFILE
#endif /* PROFILE */
#endif /* HYBRID */
#ifndef DEBUG
#ifndef HYBRID
#ifdef PROFILE
#undef PROFILE
#endif /* PROFILE */
#endif /* !HYBRID */
#endif /* !DEBUG */

#define wUnusedHeapWord 0xFFFF  /* sorry, BV, needed an odd number */

/* number of characters of extra global space for debugging routines */
#define cchDebug        2048

#ifdef DEBUG
#define ShowLbs(a, b) (!vdbs.fShowLbs ? 0 : ShowLbsProc(a, b))
#else
#define ShowLbs(a, b)
#endif
#ifdef DEBUG

#define Scribble(a, b) (!vdbs.grpfScribble ? 0 : ScribbleProc(a, b))
#else
#define Scribble(a, b)
#endif

/* S C R I B B L E  P O S I T I O N S */
#define ispNil          -1   /* set isp to ispNil to disable */
/* continious operations */
#define ispIdle1        1
#define ispIdle2        0
#define ispIdleComplete 2
#define ispInsertLine   3

/* frequent operations */
#define ispInsertMode   7
#define ispUpdateWw     6
#define ispQuickSave    5
#define ispSavePass     6
#define ispInitStructs  6
#define ispDisplayFli   5
#define ispAdjustCp     5
#define ispFormatLine   5
#define ispWireFont     4

/* format operations */

/* Debug0 is useful when null expression disallowed, as in the use
	of comma operator in pic.c e.g., if ((Debug(i=2), foo))  
*/

#ifdef DEBUG
#define Debug(e) e
#define Debug0(e) e
#else
#define Debug(e)
#define Debug0(e) 0
#endif

/* B A T C H */
/* Batch mode code is defined under #ifdef BATCH, so it can be used */
/* in non-debug versions.  In the debug version, BATCH is always defined, */
/* but in non-debug versions BATCH must be supplied as an explicit compile */
/* flag. */
#ifdef DEBUG
#define BATCH
#endif

/* Batch is similar to the Debug conditional expression macro */
#ifdef BATCH
#define Batch(e) e
#else
#define Batch(e)
#endif

/* M A R K */
/* call MarkProc conditionally */
#ifdef DEBUG
#define Mark(e) MarkProc(e)
#else
#define Mark(e)
#endif

/* F  R A R E  T */
/* identifies a value that is rarely true, but if vjRare is set to
the identifying number, a true value will be substituted for testing
purposes.
*/
#ifdef DEBUG
#define FRareT(n, f) ((f) || FRareProc(n))
#else
#define FRareT(n, f) (f)
#endif

/* F  R A R E  F */
/* as above, except the value is rarely false.
*/
#ifdef DEBUG
#define FRareF(n, f) ((f) && !FRareProc(n))
#else
#define FRareF(n, f) (f)
#endif

/* E R R O R S */

#ifdef DEBUG /* ERRORSTRINGS */
#define DiskError(idpmt, fn, msg)       DiskErrorProc(idpmt, fn, SzShared(msg))
#else
#define DiskError(idpmt, fn, msg)       DiskErrorProc(idpmt, fn)
#endif

#define SetErrorMat(mat)		SetErrorMatProc(mat)



/* C A  T E M P */
#ifdef DEBUG
#define AcquireCaAdjust() { extern int cCaAdjust; ++cCaAdjust; \
								Assert (caAdjust.doc == docNil); \
								Assert (cCaAdjust == 1); }
#define ReleaseCaAdjust() { extern int cCaAdjust; --cCaAdjust; \
								Assert (cCaAdjust == 0); \
								caAdjust.doc = docNil; }
#define AcquireCaAdjustL() { extern int cCaAdjustL; ++cCaAdjustL; \
								Assert (caAdjustL.doc == docNil); \
								Assert (cCaAdjustL == 1); }
#define ReleaseCaAdjustL() { extern int cCaAdjustL; --cCaAdjustL; \
								Assert (cCaAdjustL == 0); \
								caAdjustL.doc = docNil; }
#else
#define AcquireCaAdjust()
#define ReleaseCaAdjust()
#define AcquireCaAdjustL()
#define ReleaseCaAdjustL()
#endif

/* D O C  S C R A T C H */
#ifdef DEBUG
extern BOOL fDocScratchInUse;
#define ReleaseDocScratch() Assert (!(fDocScratchInUse = !fDocScratchInUse))
#else
#define ReleaseDocScratch()
#endif /* DEBUG */

/* S T A T I C */
/* STATIC is a way of declaring a procedure that we will only reference within */
/* a module, but whose symbol we don't want to hide from the debugger. */
#ifdef DEBUG
#define STATIC
#else
#define STATIC static
#endif



#ifdef DEBUG

#define dbctFli 0
#define dbctDisplay 1
#define dbctLr 2

#define cTestsPrefs	36
#define pchTestMin   	((char *)&vdbs.fCkDoc)
#define pchPrefMin  	((char *)&vdbs.fCommSz)
#define pchUseCMin	((char *)&vdbs.CFetchCp)

#define cchDbgBuf1      320
#define cchDbgBuf2      80

#define nDbsuVerCur	7

struct DBS              /* DeBug State */
		{
	struct DBSU
		/* This structure forms the stored file, it must be first */
		{
		/* version */
/* 0 */	    int nDbsuVer;

			/* Consistency checking routine "on/off" switches */
/* 2 */     char fCkDoc;/* must be first */
			char fCkFn;
			char fCkWw;
			char fCkBptb;

			char fCkFkp;
			char fCkPlcbte;
/* 8 */     char fCkFli;
			char fCkScc;

			char fCkPrm;
			char fCkDlg;
			char fCkHeap;
			char fShakeHeap;

			char fCkStruct;
			char fCkFont;
/* 10 */    char fCkMwd;
		char fCk16;

			char fCkFldDel;
			char fCkFldIdle;
			char fCkLHRUpd;
			char fCkScroll;          /* see scroll.c */

			char fCkPaph;  
			char fCkText;
/* 18 */    char fCkTlbx;
		char fCkTableSel;
#define cTestsUsed  24

		char fCk25;
		char fCk26;
		char fCk27;
		char fCk28;

		char fCk29;
		char fCk30;
/* 20 */    char fCk31;
		char fCk32;

		char fCk33;
		char fCk34;
		char fCk35;
		char fCk36;


		/* debugging preferences */
			char fCommSz; /* must be first */
			char fMoreComm;
/* 28 */    char fRipToDbgScreen;
			char fRetryDef;

			char fReports;
		char fRipOnError;
			char fFailInMcr;
			char fReportHeap;

			char fFixedMem;
			char fOutsideCmd;
/* 30 */    char fHeapAct;
			char fWinAct;

			char fTraceGDI;
			char fNoCoreLoad;
		char fNoInfoRTF;
		char fFail8087;

		char fCommDde1;
		char fCommDde2;
/* 38 */    char fNoEmm;
		char fBreakOnFail;

		char fNoFillBlock;
		char fCallSetFlm;
		char fCommPrint;
		char fCoverActive;

		char fShowDirty;
		char fCompressOften; /* causes compression to occur more often */
/* 40 */    char fTrackGdiHandles;
		char fUseTextOut;	/* Use TextOut instead of ExtTextOut() */

		char fShowLbs;    /* show layout rectangles during layout process */
		char fSmallFileCache;	/* File cache same size as if no EMM */
		char fNoRtfConv;
		char fAllGraphicsBands; /* Mark all bands as graphics bands */

		char fExtTextOutNull;	/* Use ExtTextOut() but make extra values null */
		char fDumpMessages;		/* Output messages in wprocn.asm */
/* 48 */    char fVerboseHeapInfo;
		char fDumpPicInfo;
#define cPrefsUsed 36


		/* use C versions flags */
/* 4A */    char CFetchCp;  /* must be first */
		char CCachePara;
		char CFormatLine;
		char CLoadFont;

		char CCpSearchSz;
		char CCpSearchSzBackward;
/* 50 */    char CFfcFormatField;
		char CDcpSkipFieldChPflcd;

		char CFShowResultPflcdFvc;
		char CIfldFromDocCp;
		char CFillIfldFlcd;
		char CGetIfldFlcd;

		char CSetFlcdCh;
		char CIfldInsertDocCp;
/* 58 */    char CFetchVisibleRgch;
		char CFetchCpPccpVisible;

		char CCpVisibleCpField;
		char CFVisibleCp;
		char CDisplayFliCore;
		char CFMarkLine;

		char CXpFromDcp;
		char CMapStc;
/* 60 */    char CAddVisiSpaces;
		char CApplyPrlSgc;

		char CFGetParaState;
		char CFGraphicsFcidToPlf;
		char CPnFromPlcbteFc;
		char CBFromFc;

		char CHpchFromFc;
		char CHpchGetPn;
/* 68 */    char CIbpCacheFilePage;
		char CDoPrmSgc;

		char CLoadFcidFull;
		char CFDisplayFli;
		char CResetFont;
		char unused2;
#define cUseCUsed   36

		/* scribbles */
		int grpfScribble;

/* 70 */    int rgwSpare [4];

			/* end stored part of DBS */
		};

	/* Following are session based only */

	/* allocation failure control */
	/* code in initwin.c depends on the order of these */
	int cLmemSucceed;
	int cLmemFail;
	int cWinSucceed;
	int cWinFail;
		int cLmemCalls;
		int cWinCalls;

		int fInfoAssert;    /* RTF */
		int fSprmTablesChecked;
		int StatLine;
		int cdlInval;
		int fScan;              /* true iff scanning dialogs */
		/* number of lines output to provide debugging status info.
		Needed to implement scrolling when outputting status info. */
		int jc1;
		int jnScc;              /* Scc test number to skip to */
		int fJoinBelow;         /* return value from CheckSccs */
		int fJoinAbove;         /* return value from CheckSccs */
		/* global stuff to be used with the debugging file read routines */
		FC fcCur;
		int osfn;
		char stRoutineName[30];
		char stFile[256];
		int fFlushFailed;

